{
  "title": "Maji Ndogo Water Crisis - Part 1: Beginning Your Data Driven Journey",
  "description": "Explore survey data from President Naledi's water quality initiative. Learn to navigate databases, understand water source types, identify data quality issues, and make corrections using SQL.",
  "estimated_minutes": 480,
  "learning_objectives": [
    {
      "level": "analyze",
      "description": "Analyze survey data to identify patterns in water access and quality issues"
    },
    {
      "level": "evaluate",
      "description": "Evaluate data integrity by identifying contradictions and errors in records"
    },
    {
      "level": "apply",
      "description": "Apply SQL queries including SELECT, WHERE, LIKE, and UPDATE to explore and correct data"
    },
    {
      "level": "create",
      "description": "Create safe data modification workflows using backup tables and tested queries"
    }
  ],
  "narrative_context": "You've joined President Aziza Naledi's initiative to solve Maji Ndogo's water crisis. A team of engineers, field workers, scientists, and analysts has collected 60,000 survey records about water sources across the country. Your mentor Chidi Kunto will guide you through this data - every query you write helps uncover the story of communities struggling for clean water. The insights you extract will shape real decisions about where to install water purification systems.",
  "content": "# Welcome to the Maji Ndogo Water Analysis Project\n\nThis project takes you through a real-world data analysis scenario where you'll explore survey data about water sources in the fictional country of Maji Ndogo.\n\n## Database: md_water_services\n\nThe database contains the following tables:\n- **column_legend**: Data dictionary explaining each column\n- **employee**: Survey team member information\n- **global_water_access**: Comparative water access statistics\n- **location**: Geographic information (address, province, town, urban/rural)\n- **water_quality**: Subjective quality scores from surveyors\n- **visits**: Log of visits to water sources with queue times\n- **water_source**: Types of water sources and people served\n- **well_pollution**: Contamination test results for wells\n\n## Your Mentor: Chidi Kunto\n\nChidi is a senior data analyst who will guide you through this project. He'll break down President Naledi's instructions into clear tasks, share professional tips, and help you develop good data analysis habits.\n\n## What You'll Learn\n\n1. **Database exploration** - Using SHOW TABLES and SELECT to understand unfamiliar data\n2. **Data filtering** - Using WHERE clauses to find specific records\n3. **Pattern matching** - Using LIKE for text pattern searches\n4. **Data integrity** - Identifying contradictions and errors in data\n5. **Safe modifications** - Using backup tables and tested UPDATE queries",
  "epics": []
}
